tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nshipster/formulae"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Platform built on V8 to build network applications
brew "node"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Internet file retriever
brew "wget"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Draw.io is free online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Virtual globe
cask "google-earth-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to manage software development and track bugs
cask "linear-linear"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
cask "spark"
# Music streaming service
cask "spotify"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "Craft", id: 1487937127
mas "Dark Noise", id: 1465439395
mas "Deliveries", id: 290986013
mas "Exchange Rates", id: 1463361068
mas "Focused Work", id: 1523968394
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "MeetingBar", id: 1532419400
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OTP Manager", id: 928941247
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "TickTick", id: 966085870
mas "Timery", id: 1425368544
mas "Transporter", id: 1450874784
mas "Trello", id: 1278508951
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 1147396723
