tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "knocklabs/tap"
tap "maticzav/swift-graphql", "https://github.com/maticzav/swift-graphql.git"
tap "nshipster/formulae"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler2"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Bidirectional operation between a Subversion repository and Git
brew "git-svn"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Command-line interface for Vercel
brew "vercel-cli"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Refactoring tool for Erlang with emacs and Eclipse integration
brew "wrangler"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Build and manage your notifications with Knock directly from the command-line
brew "knocklabs/tap/knock"
# Code generator for SwiftGraphQL library
brew "maticzav/swift-graphql/swiftgraphql"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Client for the Google Drive storage service
cask "google-drive"
# Virtual globe
cask "google-earth-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "Exchange Rates", id: 1463361068
mas "Keynote", id: 409183694
mas "MeetingBar", id: 1532419400
mas "Numbers", id: 409203825
mas "OTP Manager", id: 928941247
mas "Pages", id: 409201541
mas "RocketSim", id: 1504940162
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Timery", id: 1425368544
vscode "adam-watters.vscode-color-pick"
vscode "arturock.gitstash"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "formulahendry.auto-rename-tag"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-typescript-next"
vscode "patbenatar.advanced-new-file"
vscode "pomber.git-file-history"
vscode "rioukkevin.vscode-git-commit"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
