tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Python dependency management tool
brew "pipenv"
# File browser
brew "ranger"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Internet file retriever
brew "wget"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Virtual globe
cask "google-earth-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
cask "spark"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "Craft", id: 1487937127
mas "Deliveries", id: 290986013
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Focused Work", id: 1523968394
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OTP Manager", id: 928941247
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "TickTick", id: 966085870
mas "Timery", id: 1425368544
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 1147396723
